simulations/OF12/hydropower/of_interFoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         100.0;

deltaT          0.001;

writeControl adjustableRunTime;

writeInterval 0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

maxAlphaCo      0.2;

maxDeltaT       1;

writeObjects (nut k epsilon);

