simulations/OF12/hydropower/of_interFoam/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

//simulationType  laminar;
simulationType  RAS;
RAS
{
    RASModel    kEpsilon;
    turbulence  on;
    printCoeffs on;

    kEpsilonCoefs
    {
        Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmak      1.0;
        sigmaEps    1.3;
    }
}
