simulations/OF12/hydropower/of_interFoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3e-4;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;               // 5% (adjust to your case)
        U               U;                  // link to inlet U
        value           uniform 3e-4;
    }

    side_wall
    {
        type            kqRWallFunction;
        value           uniform 3e-4;
    }

    bottom_wall
    {
        type            kqRWallFunction;
        value           uniform 3e-4;
    }

    top_wall
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //

