simulations/OF12/hydropower/of_interFoam/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 8;

method          scotch;

